review-evidence/96-r1/author/logs/mutations/M28_wrong_child_param/mutation.diff
--- $CANDIDATE/hdl/top/protocol_processor_top.sv	2026-09-22 06:37:11.775000000 +0200
+++ $MUTATION_STORAGE/M28_wrong_child_param/hdl/top/protocol_processor_top.sv	2026-09-22 06:48:48.423000000 +0200
@@ -2144,7 +2144,7 @@
   KL_srp_top #(
       .N_SOURCES_P      (N_STREAM_OUT_P),
       .N_SINKS_P        (N_STREAM_IN_P),
-      .DOM_DEF_VID_P    (SRP_DOM_DEF_VID_P),
+      .DOM_DEF_PRIO_P   (SRP_DOM_DEF_VID_P[7:0]),
       .TX_STD_BYTES_P   (576),
       .TX_OVERSIZE_BYTES_P (TX_OVERSIZE_BYTES_P),
       .SLOT_AW_P        (TMR_AW_C),
